# FabricationHangerCannotBeSloped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationHangerCannotBeSloped Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
A hanger cannot be sloped or placed on a sloped element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationHangerCannotBeSloped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationHangerCannotBeSloped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationHangerCannotBeSloped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace